kabirz/zephyr/include/zephyr/dt-bindings/clock/gd32h7xx-clocks.h
/*
 * Copyright (c) 2026 GD32H7xx Zephyr bring-up
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32H7XX_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32H7XX_CLOCKS_H_

#include "gd32-clocks-common.h"

/**
 * @name Register offsets
 * @{
 */

#define GD32_AHB1EN_OFFSET       0x30U
#define GD32_AHB2EN_OFFSET       0x34U
#define GD32_AHB3EN_OFFSET       0x38U
#define GD32_AHB4EN_OFFSET       0x3CU
#define GD32_APB1EN_OFFSET       0x40U
#define GD32_APB2EN_OFFSET       0x44U
#define GD32_APB3EN_OFFSET       0x48U
#define GD32_APB4EN_OFFSET       0x4CU
#define GD32_ADDAPB2EN_OFFSET    0xE4U

/** @} */

/**
 * @name Clock enable/disable definitions for peripherals
 * @{
 */

/* AHB4 peripherals */
#define GD32_CLOCK_GPIOA      GD32_CLOCK_CONFIG(AHB4EN, 0U)
#define GD32_CLOCK_GPIOB      GD32_CLOCK_CONFIG(AHB4EN, 1U)
#define GD32_CLOCK_GPIOC      GD32_CLOCK_CONFIG(AHB4EN, 2U)
#define GD32_CLOCK_GPIOD      GD32_CLOCK_CONFIG(AHB4EN, 3U)
#define GD32_CLOCK_GPIOE      GD32_CLOCK_CONFIG(AHB4EN, 4U)
#define GD32_CLOCK_GPIOF      GD32_CLOCK_CONFIG(AHB4EN, 5U)
#define GD32_CLOCK_GPIOG      GD32_CLOCK_CONFIG(AHB4EN, 6U)
#define GD32_CLOCK_GPIOH      GD32_CLOCK_CONFIG(AHB4EN, 7U)

/* APB1 peripherals */
#define GD32_CLOCK_TIMER1     GD32_CLOCK_CONFIG(APB1EN, 0U)
#define GD32_CLOCK_TIMER2     GD32_CLOCK_CONFIG(APB1EN, 1U)
#define GD32_CLOCK_TIMER3     GD32_CLOCK_CONFIG(APB1EN, 2U)
#define GD32_CLOCK_TIMER4     GD32_CLOCK_CONFIG(APB1EN, 3U)
#define GD32_CLOCK_TIMER5     GD32_CLOCK_CONFIG(APB1EN, 4U)
#define GD32_CLOCK_TIMER6     GD32_CLOCK_CONFIG(APB1EN, 5U)
#define GD32_CLOCK_USART1     GD32_CLOCK_CONFIG(APB1EN, 17U)
#define GD32_CLOCK_USART2     GD32_CLOCK_CONFIG(APB1EN, 18U)
#define GD32_CLOCK_UART3      GD32_CLOCK_CONFIG(APB1EN, 19U)
#define GD32_CLOCK_UART4      GD32_CLOCK_CONFIG(APB1EN, 20U)
#define GD32_CLOCK_I2C0       GD32_CLOCK_CONFIG(APB1EN, 21U)
#define GD32_CLOCK_I2C1       GD32_CLOCK_CONFIG(APB1EN, 22U)
#define GD32_CLOCK_UART6      GD32_CLOCK_CONFIG(APB1EN, 30U)
#define GD32_CLOCK_UART7      GD32_CLOCK_CONFIG(APB1EN, 31U)

/* APB2 peripherals */
#define GD32_CLOCK_TIMER0     GD32_CLOCK_CONFIG(APB2EN, 0U)
#define GD32_CLOCK_USART0     GD32_CLOCK_CONFIG(APB2EN, 4U)
#define GD32_CLOCK_USART5     GD32_CLOCK_CONFIG(APB2EN, 5U)
#define GD32_CLOCK_SPI0       GD32_CLOCK_CONFIG(APB2EN, 12U)

/* APB4 peripherals */
#define GD32_CLOCK_SYSCFG     GD32_CLOCK_CONFIG(APB4EN, 0U)

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_GD32H7XX_CLOCKS_H_ */
